In [1]:
import pandas as pd

In [10]:
data = {
    "Name" : ["Mahy", "Bgu", "Omny"],
    "Age" : [25, 24, 0],
    "City" : ["Hyderabad", "Bangalor", "Universe"],
    "Salary" : [25000, 30000,100000000000]
}
df = pd.DataFrame(data)
print(df,"\n")

# Adding Columns
df["Bonus"] = df["Salary"] * 10
print(df)

   Name  Age       City        Salary
0  Mahy   25  Hyderabad         25000
1   Bgu   24   Bangalor         30000
2  Omny    0   Universe  100000000000

   Name  Age       City        Salary          Bonus
0  Mahy   25  Hyderabad         25000         250000
1   Bgu   24   Bangalor         30000         300000
2  Omny    0   Universe  100000000000  1000000000000

In [ ]:
# df.insert(0,"Emp ID", [101,102,03])leading zeros in decimal integer literals are not permitted; 
# use an 0o prefix for octal integers
df.insert(0,"Emp ID", [101,102,103]) 
print(df)

   Emp ID  Name  Age       City        Salary          Bonus
0     101  Mahy   25  Hyderabad         25000         250000
1     102   Bgu   24   Bangalor         30000         300000
2     103  Omny    0   Universe  100000000000  1000000000000

In [19]:
# using .loc() to update specific values
df.loc[0,"Salary"] = 50000
print(df)

   Emp ID  Name  Age       City        Salary          Bonus
0     101  Mahy   25  Hyderabad         50000         250000
1     102   Bgu   24   Bangalor         30000         300000
2     103  Omny    0   Universe  100000000000  1000000000000

In [22]:
# Update Exsinting Values
df["Salary"] = df["Salary"] * 10
df

   Emp ID  Name  Age       City          Salary          Bonus
0     101  Mahy   25  Hyderabad         5000000         250000
1     102   Bgu   24   Bangalor         3000000         300000
2     103  Omny    0   Universe  10000000000000  1000000000000

In [ ]:
# Remove Columns
df.drop(columns = ['Emp ID'], inplace=True)
df

   Name  Age       City          Salary          Bonus
0  Mahy   25  Hyderabad         5000000         250000
1   Bgu   24   Bangalor         3000000         300000
2  Omny    0   Universe  10000000000000  1000000000000